## IMPORT AND LOAD ##

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

sns.set_theme(style="whitegrid")

df = pd.read_csv('../data/raw/candidates.csv', sep=';') 
print(f"Dataset dimensions: {df.shape}")
display(df.head())

Dimensiones del dataset: (50000, 10)

,First Name,Last Name,Email,Application Date,Country,YOE,Seniority,Technology,Code Challenge Score,Technical Interview Score
0,Bernadette,Langworth,leonard91@yahoo.com,2021-02-26,Norway,2,Intern,Data Engineer,3,3
1,Camryn,Reynolds,zelda56@hotmail.com,2021-09-09,Panama,10,Intern,Data Engineer,2,10
2,Larue,Spinka,okey_schultz41@gmail.com,2020-04-14,Belarus,4,Mid-Level,Client Success,10,9
3,Arch,Spinka,elvera_kulas@yahoo.com,2020-10-01,Eritrea,25,Trainee,QA Manual,7,1
4,Larue,Altenwerth,minnie.gislason@gmail.com,2020-05-20,Myanmar,13,Mid-Level,Social Media Community Management,9,7

## Data types and null values ##

In [ ]:
df.info()

nulos = df.isnull().sum()
print("\nNull values per column:\n", nulos[nulos > 0])

<class 'pandas.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   First Name                 50000 non-null  str
 1   Last Name                  50000 non-null  str
 2   Email                      50000 non-null  str
 3   Application Date           50000 non-null  str
 4   Country                    50000 non-null  str
 5   YOE                        50000 non-null  int64
 6   Seniority                  50000 non-null  str
 7   Technology                 50000 non-null  str
 8   Code Challenge Score       50000 non-null  int64
 9   Technical Interview Score  50000 non-null  int64
dtypes: int64(3), str(7)
memory usage: 3.8 MB

Valores Nulos por columna:
 Series([], dtype: int64)

## Descriptive statistics ##

In [3]:
display(df.describe())

print("\nUnic Values in Code Challenge Score:", sorted(df['Code Challenge Score'].unique()))
print("Unic Values in Technical Interview Score:", sorted(df['Technical Interview Score'].unique()))

                YOE  Code Challenge Score  Technical Interview Score
count  50000.000000          50000.000000               50000.000000
mean      15.286980              4.996400                   5.003880
std        8.830652              3.166896                   3.165082
min        0.000000              0.000000                   0.000000
25%        8.000000              2.000000                   2.000000
50%       15.000000              5.000000                   5.000000
75%       23.000000              8.000000                   8.000000
max       30.000000             10.000000                  10.000000

Unic Values in Code Challenge Score: [np.int64(0), np.int64(1), np.int64(2), np.int64(3), np.int64(4), np.int64(5), np.int64(6), np.int64(7), np.int64(8), np.int64(9), np.int64(10)]
Unic Values in Technical Interview Score: [np.int64(0), np.int64(1), np.int64(2), np.int64(3), np.int64(4), np.int64(5), np.int64(6), np.int64(7), np.int64(8), np.int64(9), np.int64(10)]

## Categories Analysis ##

In [4]:
paises_objetivo = [p for p in df['Country'].unique() if p in ['United States', 'USA', 'United States of America', 'Brazil', 'Colombia', 'Ecuador']]
print("Países encontrados para el KPI:", paises_objetivo)

print("\nDistribución de Seniority:")
print(df['Seniority'].value_counts())

Países encontrados para el KPI: ['United States of America', 'Ecuador', 'Brazil', 'Colombia']

Distribución de Seniority:
Seniority
Intern       7255
Mid-Level    7253
Trainee      7183
Junior       7100
Architect    7079
Lead         7071
Senior       7059
Name: count, dtype: int64

## Exact duplicates ##

In [5]:
duplicados = df.duplicated().sum()
print(f"Filas duplicadas idénticas encontradas: {duplicados}")

Filas duplicadas idénticas encontradas: 0